//index.js
//获取应用实例
const app = getApp()

Page({
  data: {
    indicatorDots: true,
    vertical: false,
    autoplay: false,
    circular: false,
    interval: 2000,
    duration: 500,
    previousMargin: 0,
    nextMargin: 0,
    imgUrls: [
     "../../image/swiper1.jpg",
      "../../image/swiper2.jpg",
      "../../image/swiper3.jpg",
      "../../image/swiper4.jpg"
    ],
    news:[
      {
        "imageUrl":"../../image/course_img1.png",
        "title":"天网地网水网环保“一网打尽”？",
        "content":"垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类"
      },
      {
        "imageuil": "",
        "title": "天网地网水网环保“一网打尽”？",
        "content": "垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类"
      },
      {
        "imageuil": "",
        "title": "天网地网水网环保“一网打尽”？",
        "content": "垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类垃圾分类"
      }
    ],
    course: [
      {
        "imageUrl": "../../image/course_img1.png",
        "num":"666",
        "title": "【更新】你有多久没投资自己了”？",
        "teacher":"老路的第二次音频课程",
        "description":"高级投资课程",
        "content": "投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程"
      },
      {
        "imageUrl": "../../image/course_img1.png",
        "num": "666",
        "title": "【更新】你有多久没投资自己了”？",
        "teacher": "老路的第二次音频课程",
        "description": "高级投资课程",
        "content": "投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程"
      },
      {
        "imageUrl": "../../image/course_img1.png",
        "num": "666",
        "title": "【更新】你有多久没投资自己了”？",
        "teacher": "老路的第二次音频课程",
        "description": "高级投资课程",
        "content": "投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程"
      },
      {
        "imageUrl": "../../image/course_img1.png",
        "num": "666",
        "title": "【更新】你有多久没投资自己了”？",
        "teacher": "老路的第二次音频课程",
        "description": "高级投资课程",
        "content": "投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程"
      },
      {
        "imageUrl": "../../image/course_img1.png",
        "num": "666",
        "title": "【更新】你有多久没投资自己了”？",
        "teacher": "老路的第二次音频课程",
        "description": "高级投资课程",
        "content": "投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程"
      },
      {
        "imageUrl": "../../image/course_img1.png",
        "num": "666",
        "title": "【更新】你有多久没投资自己了”？",
        "teacher": "老路的第二次音频课程",
        "description": "高级投资课程",
        "content": "投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程投资自己高级投资课程"
      }
     
    ]

  },
  //事件处理函数
  bindViewTap: function () {

    wx.navigateTo({
      url: '../logs/logs'
    })
  },
  onShow: function () {
    //this.login();
  },
  onLoad: function () {
    var that = this;
    // 获取屏幕高度
    wx.getSystemInfo({
      success: function (res) {
        console.info(res.windowHeight);
        that.setData({
          scrollHeight: res.windowHeight
        });
      }
    });
  }
})
